[
  {
    "review_text": "So much fun to put together: Oh wait…. No it’s not, so to whomever isn’t the factory, please don’t over tighten screws we are suppose to loosen in order to put together, one screw on the shelf system is so tight I can’t get it loose and I’m not a weak guy.",
    "review_rating": "4",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Awesome Griddle: I have heard about how great Blackstone griddles were so I wanted to find out for myself just how good they were and Boy I was not disappointed. The only thing that I experienced that was bad was that the first griddle had a bad ignition It would not light unless you lite it with a grill lighter and also the knobs malfunctioned also but I went back to Lowe’s and they just exchanged it for me. I also sent a email to blackstone and they sent me new knobs and ignition wires other than those things ...",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Be cautious when purchasing from lowes: Did not work propane not getting thru would not light. , knobs fell off, had it put together by lowes. I returned it will never buy anthing again from lowes.",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "assembly was horrible: took the free assembly and nothing on this grill works. Neither of the burner dials or the ignite button works. Highly disappointed in Lowes!!!",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "Great Blackstone: Great grill, perfect size, breakfast on the grill is exceptional, steaks are perfect as are the veggies we grill.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Buy it put together.: First one didn’t come with all the parts so they didn’t put it together the time they told me. Second got it home and it didn’t work so had to drive a hour 4 times. The second one works fine just had to go back again to pick up.",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Blackstone Review: It was easy to assemble, cooks great and has enhanced the different types of food that I can grill outside.  I like it better than the original gas barbeque. I have used it several times and cooking times are great and it does cook better and faster than a standard gas grill",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "One of the knobs are broken: One of the knobs won’t stay on the Blackstone so I’m having to pop it on and off to use both sides. Hoping to get it replaced. Was a little harder than we thought to put together.",
    "review_rating": "4",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Absolutely amazing: How easy this grill is to use and clean is truly great. The fact that the manufacturer has videos set up to show you how to get your grill going makes everything easier.  5/5 would recommend anyone in the market to stick with blackstone!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Amazing product: I have enjoyed so much different types of food, which has gotten me out of my comfort zone, but it has been nothing short of delicious.  I live in the Pittsburgh area, soI thought I would experiment with pierogies. My experiment yielded awesome results.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Excellent — No other griddle compares: My new Blackstone is just top notch. Every inch is quality. It outperforms my previous griddles of different brands — no contest. Rear drip tray is absolutely heavenly; it’s one of those things you don’t think about until you experience its ease of use. The cook top seasoned up perfectly with absolute ease, and I just can’t stop cooking dinner on it. I think about cooking on my blackstone at work. I think about it in traffic, I think about it in bed trying to sleep, I dream about it. Absolutely ...",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Excited: Always wanted one, was given this for Mother’s Day gift. Looking forward to enjoying many meals on it. Haven’t used it just yet, just opened the box. Seems well made and sturdy.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "NA",
    "quality": "1"
  },
  {
    "review_text": "Sweet: Picking up this grill was a great choice, despite tough times a grill like this saves electricity and isn't heating up the house in the summer months. We've already cooked burgers, chicken and steaks. My only grandson Leland just started football practice for the first time at 13. This grill will help to ensure his mom can cook the healthiest of foods with the great taste from our new Blackstone grill.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Havnt used it yet so...: Registered my grill and asked for this review. Only put ot together and seasoned it but so far, so good.  I did a ton of research so fully expect this to be 5 stars.",
    "review_rating": "5",
    "durablility": "NA",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Quadruple burger: This Blackstone Griddle has been amazing so far. We are still figuring out the cooking techniques but my son rocked his first burger and it sure was a tall one!!! He can't wait to cook again on it.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Loose knob: Quick and easy assembly, went through the seasoning process and cooked dinner on it, everything was great. The only issue being is that one of the knobs is loose. Meaning to ignite and or turn off one side of the griddle, you must take the knob off and push in the pin with your hand as the knob won’t hold onto it. Still enjoy the product, just a little bit upset about the minor inconvenience",
    "review_rating": "3",
    "durablility": "0",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New griddle owner: I just purchased my first griddle and I'm excited to try it out, just as soon as I watch the video and get it set up to use!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Just got it!: While we like the idea of the griddle we were a little deflated when we picked up our purchase. It wasn’t as hefty as we thought it would be for the price we paid. We assumed wrongly the the wheels had locks and we thought it came with a hood. However we are going to keep it and see how we like cooking with it. Who knows, maybe we will invest in a fancier model at a later date.",
    "review_rating": "3",
    "durablility": "0",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "It is different from most grills: Not sure yet how it works",
    "review_rating": "5",
    "durablility": "NA",
    "ease_of_use": "NA",
    "quality": "1"
  },
  {
    "review_text": "Great! But...: I got my new Blackstone and I love it. Seasoning it was quick and easy without much problem. Once I got it assembled though the burner control knob broke and won't go back on. A bit disappointed this isn't better construction. Otherwise I would recommend getting one of these. It is amazing the way food tastes off a flat top. I am also amazed at how much and how fast it cooks.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "1",
    "quality": "-1"
  },
  {
    "review_text": "Best grill: Best grill I ever had! Only one problem igniter didn't work but thats ok I just light it with a lighter, still love it!!!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great cooking appliance!: A welcome transition from a previous “gas grill” user. Clean up is so much easier and the cook top is extremely versatile allowing more food types to be cooked on “one” surface.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Not worth it: This model isn't worth it. Two burners is not enough to hold a good temp. It also requires you finesse the gas so you get full burn. IDK if it's the regulator or what but it shouldn't be an issue with a $300 griddle. \n\nThe griddle itself is also too thin. It warped after a few uses. \n\nWould not recommend.",
    "review_rating": "2",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "Disappointed: I bought this on sale at Lowes this weekend (March 2024).  I knew this was not top of the line model and was willing to give it a go.  Here are some of my things I found disappointing:\nGouges on the grill flattop (out of the box), these are not unseasoned portions\nFlattop not being lined up accurately to fit into pre made slots.  The hole was at least a 1/2 inch off\nFlimsy state of the side tables.  The side tables I know will only hold up to 10 lbs, but they slant considerably and anything you ...",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "You have to season it first  not hard to do: Cooks  great love it",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New to blackstone: I’m excited to get started, grill looks and feels very solid. Smash burgers and eggs /bacon are first things I’m excited to start cooking.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great for everything!: Easy set up,easy to maintain,amazing for anything you can think of that you want to use a griddle for! Only downside I ran into was trying to get it to light on the close left close side first it would not start in the very beginning after a few tries messing with the prongs to form an spark it finally clicked on and would work fine from then on not sure what the initial problem was with the left side, even though the right far side would start perfect everytime.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Really bad experience: Purchased a Blackstone Griddle and had the \"Expert assembly option added\" . \nWhen the first went load in the truck one wheel feel of. Had a missing nut on one of the 2 wheels. Should have been my signal. The Lowes employee went back inside with bolt and grabbed a nut (non locking as required on a wheel) and added it to keep wheel on. I told them I would replace nut at one with a Nylon locking nut.\nGot it home and got ready to season grill. lit 1st burn, no problems and second one would not ignit...",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "New Blackstone purchase: Just purchased this blackstone with high hopes. Not crazy about hanging the lid on the back of grill, the drip pan makes it stick out instead of hanging straight. Had to light it with a lighter as the igniter doesn’t work, there’s a clicking but doesn’t ignite even after troubleshooting.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Love it! Not your typical grill: Great griddle! Easy to assemble. Food cooks evenly. Excited to use it on a regular basis for all types of cooking.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Looks Nice So Far: Overall assembly was easy. Did end up missing one screw that goes to the handles of the hard cover (found a replacement). Wouldn't start at first. Did the troubleshooting and concluded that the igniter wires that create the spark next to the burners weren't close enough. Had to do a little bending and tweaking; it starts now. Product looks really nice though, and will be seasoning it for the first time real soon. Maybe could update this rating to 5 stars afterwards.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "0"
  },
  {
    "review_text": "Blackstone grill: Great grill easy to use and easy to season. \nThe guys at Lowes put it together for me and loaded in my car. Love this grill \nThank you",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "So far so good!: I got my Blackstone a week ago and I have seasoned it, and will cook my first meal on it tonight! So far I love it! It’s a great size, looks great, and the manual has been so helpful! I would definitely recommend Blackstone and this model of grill",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Mother’s Day present: Love my new black stone!  The kids gave it to me for Mother’s Day and cooked dinner for me.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Let the yumminess begin!: It's just the two of us here in our humble abode. However, we do have a regular crew we roll with, reg rotating deck get-togethers on which to eat, drink and be merry.  This grill? The perfect size to feed this debaucherous crew some seriously perfectly made grub!  Easy to use, easy to clean and creates the perfect sear on beef and other meat choices while simultaneously, yet gently sauteing delicate veggies on the opposite side. Buy this grill. You won't regret it.  And don't forget to initiall...",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Almost a 5: Use it twice and love it. Unfortunately the second time, turned it off then decided to cook some more and realized the knob on the right will not turn. Haven't started looking on who to talk to to get fixed, but when it is, it would definitely be 5 stars.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "0"
  },
  {
    "review_text": "Griddle top doesn’t align correctly to the base: The griddle top does align properly to the four holes on the frame that it sit in. Because of this there is a need to ‘modify’ the holes so that the griddle will sit correctly on the frame.  Based on several online comments - this seems to be a common issue so the QA process could be improved before shipping these from the factory. Other then that - works as expected.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Worked great for a week: I've had it for two weeks. The first week was great - I made burgers, steaks, chicken, shrimp, and various vegetables. All came out good. This week, one of the burner knobs came off and that burner won't light anymore.",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "1",
    "quality": "0"
  },
  {
    "review_text": "Easy put together: The easiest grill to put together. Was together in less than an hour. So excited to use it",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Very nice outdoor griddle: Easy set up. Have used it a couple times now for turkey burgers, chicken fajitas, and beef burgers. Hot side Sears really good and low side finishes them off. Also like how easy it breaks down for travel. Perfect size for m needs.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Love my griddle: The 28\" griddle with the hard cover and the soft cover is just what I was looking for in a griddle. Just got it today and can't wait until we get warmer weather so I cook on it. Will be looking for a cookbook with recipes that I can use on my new griddle.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New: First time purchasing,  easy to assemble, my only problem is M6x12 screws would not go in as instructed for right side shelf.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Perfect outdoor griddle!: Only used it once but have a feeling that we’ll\nBe using this griddle a lot this summer, exactly what we wanted!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Husbands Early Fathers Day Gift: Quality product as far as structure & parts but when we got the flat top on it was difficult because it’s warped but we had to force it and scratch it up a bit but nothing that will be noticeable",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "-1",
    "quality": "1"
  },
  {
    "review_text": "A great addition to the backyard kitchen: So far I’m very happy with the quality and value of the product. It seasoned up perfectly and we were cooking smash burgers in no time. Woke up the next morning and made a full breakfast spread. If you take care of the product…it will take care of you.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Brand new: Don’t know haven’t even built it yet why is this a required field to fill out",
    "review_rating": "4",
    "durablility": "NA",
    "ease_of_use": "NA",
    "quality": "1"
  },
  {
    "review_text": "Awesome Grill: I’ve been waiting a long time to buy this grill and it was worth every penny!!!!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "28’’ blackstone griddle: Quality control wasn’t that great, there are things that look off especially in the griddle. The griddle also did not fit well the holes were not aligned. I don’t expect this to last more than 2 years.",
    "review_rating": "5",
    "durablility": "-1",
    "ease_of_use": "0",
    "quality": "-1"
  },
  {
    "review_text": "Yours may be flawed like ours with not lighting on: The grill is nice, but we can’t get it lit by pushing we have to light it with a lighter do not like that part so something must be wrong with it to come out of the box like that",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Love it.: Couldn’t believe that actual setup instructions were easy to follow and accurate. Cooks great, easy clean up.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great!: We’ve been wanting one of these for a while, set up was quick and easy and we looking forward to using it!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Awesome Griddle: This will be my first to own, it was a house warming gift and I cannot be more excited! Super easy to put together and season. Ready for summers full of grilling, pool parties, and making memories!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great: Looking forward to learning more about how to cook with this, so far so good!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Husband Loves: Early Fathers Day and Birthday gift for the hubby. Beautiful and so easy to build!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New owner: Looking forward to trying the black stone out very easy to assemble and good instructions",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Ok: Barely have got to use it. Ok for now I guess. Assembly was a pain as the bolt hole would not line up. I’m a mechanic so I know a bolt threads in nicely or not. Ended up having to get a line-up bar in the hole and twist on it in order to get the threads to line up.",
    "review_rating": "4",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Grilled choice: We had heard good things about this brand. So So far we like it well. It would be best to purchase the seasoning and cleaning pack with the grill initially. We had to make another trip to town for it. After we finally seasoned the first time, we grilled steak fajitas and veggie mix along side. YUM YUM YUM. Happy hubby & happy wife and no regrets!  ❤️❤️❤️",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Awesome: Didnt realize how much better cooking on this griddle was compaired to the old style grills",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Griddle: Nice product overall, but the griddle isn’t very flat, it’s bowed in the middle.",
    "review_rating": "3",
    "durablility": "0",
    "ease_of_use": "-1",
    "quality": "1"
  },
  {
    "review_text": "Blackstone girl: This was the easiest grill to assmble and can’t wait to use it weekly.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New griddle.: We purchased the blackstone a couple weeks ago and I've gotten to use it multiple times already. It's amazing, heats up so fast, and easy to clean. It's been a game changer for cooking outside!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "A great product for a great price: Easy assembly with easy to read and understand instructions. Simple pictures accompany each step.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Easy build up: So easy to put together and looks like it is well designed with good materials.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Not happy: The hard cover is missing a handle and the paint on the back is chipping off, and there’s a miss alignment with the griddle one of the front pins is not sitting right.",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "Cooks everything perfect!: I've had my Blackstone Grill for two weeks now.  I'm Whole Plant Based so I cook alot of veggies on it.  The Blackstone Cooks them all prefect! I couldn't be happier with it!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "It should be great, once it works: I cleaned the grill as instructed and let it dry, I was going to heat it up and treat the top but no ignition, no click or anything.  Also the burner knob closest to the ignition button turns very rough, can't tell of it is actually working at all.  Im hoping Blackstone can help me resolve this so i can start grilling.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "Upgraded griddle: We upgraded our small portable blackstone to the 28” and we love it! Well use the smaller one for camping and now we can use the new one for more dinner ideas!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Amazing!: We have only had this griddle for a week and it has been so much fun! We have cooked breakfast, tacos, steaks and hibachi so far and everything has been amazingly yummy!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "So far so good: Just got and did breakfast for dinner. Little bit of a learning curve as far as heat goes, but once I got the hang of it, it was awesome!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Not used yet: I need a new control knob as one will not control the valve",
    "review_rating": "4",
    "durablility": "NA",
    "ease_of_use": "NA",
    "quality": "1"
  },
  {
    "review_text": "New Blackstone: Just got my new Blackstone today. My son has one and loves his.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Best all around grill: I love the blackstone grill!  If your wondering if its right for you, don't hesitate.  Its perfect for quickly cooking pancakes for a crowd.  Chicken does not come out burnt.  Great for grilling veggies.  Easy to clean with the scraper and water bottle.  I recommend the Blackstone griddle seasoning and cast iron conditioner.  We love our grill and use it weekly!",
    "review_rating": "5",
    "durablility": "NA",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "1st time owner: Just purchased and looking forward to all the great meals that will be coming",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "NA",
    "quality": "NA"
  },
  {
    "review_text": "Getting started: Everything was well packaged, took everything out of the box, checked to make sure all items were there and then assembled everything by myself with no issues. Took about 30 minutes. Need to season the griddle and try it out.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Beautiful and really fun to use!!!! It was a gift: I love it!!!! I think there could be a bit more stability in the legs and wheels but I won’t be moving it much. That’s probably the benefit of spending a bit more on the larger models",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "0"
  },
  {
    "review_text": "Excited to try the friddle: This is a new experience. So far so good. I am a little concerned that the lid is not secure on one side. The lifting it off and placing it in the back is awkward and a bit dangerous",
    "review_rating": "4",
    "durablility": "0",
    "ease_of_use": "1",
    "quality": "-1"
  },
  {
    "review_text": "OUTDOOR CHEF'S DREAM: I've been looking and waiting for the right moment to complete my outdoor cooking team. This griddle is EXACTLY what I've been after. Many members of my family in Arkansas have a Blackstone and we've enjoyed each and every cookout on them. Glad I have mine now for when they venture to Ohio!!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great grill: Haven’t used it yet, but have used friends and families and love it.",
    "review_rating": "5",
    "durablility": "NA",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Excited to use!: We have been talking about getting a flat top for a few months now and we heard great reviews about the Blackstone griddle. We are excited to use it this summer.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "pretty easy to solve problems.: Original lid damaged. no problem recieved a new one. Dids not recieve catalog so I will go tomorrow and pick one up.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "0"
  },
  {
    "review_text": "Great results from the start: Seasoned the grill per Blackstone Betty's instructional video and it was perfect.  Veggies and meets cooked perfect.  Hard to mess things up with this griddle top.  Should have purchased this a long time ago.  Thanks for all the videos and content.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Blackstone Griddle: Love the Blackstone. Unfortunately, my three uses, I have a burner that won’t ignite.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "0",
    "quality": "0"
  },
  {
    "review_text": "Everyday Use!!: Love the ease of cooking on my Blackstone and makes clean up a breeze",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Easypeasy!!!: Havent cooked on it yet, but after 3 trips to lowes for yard stuff and landscaping, it took maybe 15 minutes to put together.  And it looks great!!!",
    "review_rating": "5",
    "durablility": "NA",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "So far so good: We are currently building it and I scanned to register it… so far so good!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Almost, almost perfect: Edges could use a bit more wind shielding, and maybe a way to help level, maybe a way to just adjust legs front to back.",
    "review_rating": "4",
    "durablility": "0",
    "ease_of_use": "0",
    "quality": "1"
  },
  {
    "review_text": "Love the griddle and Blackstone but igniter didn't work: Love everything about my product as I got it for a birthday gift but upon using it the igniter didn’t work - even after going through the troubleshooting manual and video. Would love to get this part fixed so I can use it as designed.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "-1",
    "quality": "1"
  },
  {
    "review_text": "Poor Control Knob: Got this yesterday.  Left Control Knob already won’t push in.  Have to take off the knob and turn the stud by hand.  The screw head for the control knob bezels gets in the way.  The work if I install them upside down (see pic)",
    "review_rating": "2",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "So far so great: After putting it together, I noticed the ignition assembly was broken.  Hopefully Blackstone will help me get it fixed.  I used a grill starter to season it, and then cooked a few meals on it.  Meals were great and I had fun doing it.  Looking forward to more meals on the blackstone!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Too small: We are switching from a grill to the Blackstone. We thought a 28” would be big enough for our cooking. We were wrong. 32”-38” would have been the ideal size to make Japanese Hibatchi meal for 4.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "0",
    "quality": "0"
  },
  {
    "review_text": "Blackstone knobs backwards and low heat: Knobs turn opposite way. Low flames, spent 2.5 hours trying to season the grill. Followed tutorials and manual for regulator bleed, changed out propane tank, and still could never get the grill hot enough to (smoke) using the Blackstone seasoning. Disappointing purchase.",
    "review_rating": "1",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "-1"
  },
  {
    "review_text": "Quality: Strong easy to put together look forward to cooking on it",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "28” Very Nice Grill but not made well from the griddle down to the wheels: We haven’t cooked on ours yet but checking it over completely the griddle looks well made but everything else is cheap metal and not sturdy. Hopefully it meets my expectations for many years",
    "review_rating": "5",
    "durablility": "-1",
    "ease_of_use": "NA",
    "quality": "-1"
  },
  {
    "review_text": "Love it!!🥰: It works great and we love using it for our family gatherings",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "My blackstone: Brand new but the bacon cooked very well on our first try!",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Nice and solid: While I haven't used it yet, the grill is a good and solid product. Easy to put together as a number of pieces are pre-assembled.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Love it: Easy set up, great material. Can’t wait to cook on this tonight.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Awesome: I love how well it cooks and how easy it is to clean",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Great Grille: Perfect size haven’t had an issue with it yet love making all different types of meals! Been making a lot of hibachi lately 🤤",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Right Side Burner Won’t Light: Brand new. Right side burner won’t light with igniter. It does light manually. Igniter wire looks like it is in the correct position from burner tube.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "0",
    "quality": "0"
  },
  {
    "review_text": "Love it!: I love my Blackstone griddle and even gave it a name! The only drawback I have had with it, is that one of the knobs doesn't work properly. It isn't cause to take the whole thing back though. I will just get a replacement knob.",
    "review_rating": "3",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Brand new: Haven’t had a chance to use as of yet, but I can say that boxing of product was excellent and build was easy - less than 30 minutes.",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "There was a gauge in the cooking surface: Did not like Customer service. Called and was put on hold, disconnected and put on hold for an hour. Waiting on line for someone for 45 minutes. No call back either.",
    "review_rating": "2",
    "durablility": "-1",
    "ease_of_use": "-1",
    "quality": "0"
  },
  {
    "review_text": "28” griddle w hard cover: We were super excited to use our new blackstone. We are very disappointed that the paint is already peeling on the cover (grille is brand new). We emailed blackstone for a new one.",
    "review_rating": "3",
    "durablility": "-1",
    "ease_of_use": "0",
    "quality": "-1"
  },
  {
    "review_text": "Well built: I looked at, it seems like a never ending list of grills from all makes and models. We settled this one because it is well built and easy to assemble and disassemble. A lot of thought went into the design of this model.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Wanted this griddle for years!: I have wanted this for years and finally bought it. Well worth the wait!! Can’t say enough about it, easy to use, easy to put together, and cooking is easy!!!",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "1st griddle: Easy assembly, and simple instructions to season.  Cooked burgers, sausages, and bacon the first night we got it, food was great and cleanup (which I was worried about) was very easy.  Would recommend to anyone looking for a flattop grill.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "New Blackstone Griller!: Just seasoned it and looks good. I have a couple of the corners that will eventually fill in. Other than, let’s get cooking. Happy so far.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "A great Father’s Day present: My finance loves this!!! I loved the price and that it was all inclusive. I didn’t need to buy a cover or anything. And plenty of tutorials online for seasoning and how to use.",
    "review_rating": "5",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "1"
  },
  {
    "review_text": "Review: Everything looked good. The griddle went together easily enough. It was missing one of the machine screws on the griddle itself to hold the wing on so I had to run to the hardware store to get one. I will season it tomorrow and give it a gothen",
    "review_rating": "4",
    "durablility": "1",
    "ease_of_use": "1",
    "quality": "0"
  }
]